---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinScaleZ
source: html/ac3e81aa-5a9c-a77b-507c-a95d111f0e0f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodFiberPerlinScaleZ Property

The property labeled "Anisotropic pos-z scale for fiber perlin" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodFiberPerlinScaleZ { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".